IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CPSW0_ECC.xml
<module name="CPSW0_ECC" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CPSW_NUSS_VBUSP_ECC_aggr_revision" acronym="CPSW_NUSS_VBUSP_ECC_aggr_revision" offset="0x0" width="32" description="Revision parameters">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29 - 28" rwaccess="R"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1696" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x5" description="RTL version" range="15 - 11" rwaccess="R"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7 - 6" rwaccess="R"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x1" description="Minor version" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_ecc_vector" acronym="CPSW_NUSS_VBUSP_ECC_ecc_vector" offset="0x8" width="32" description="ECC Vector Register">
		<bitfield id="RD_SVBUS_DONE" width="1" begin="24" end="24" resetval="0x0" description="Status to indicate if read on serial VBUS is complete, write of any value will clear this bit." range="24" rwaccess="R/W1TC"/> 
		<bitfield id="RD_SVBUS_ADDRESS" width="8" begin="23" end="16" resetval="0x0" description="Read address" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="RD_SVBUS" width="1" begin="15" end="15" resetval="0x0" description="Write 1 to trigger a read on the serial VBUS" range="15" rwaccess="R/W1TS"/> 
		<bitfield id="ECC_VECTOR" width="11" begin="10" end="0" resetval="0x0" description="Value written to select the corresponding ECC RAM for control or status" range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_misc_status" acronym="CPSW_NUSS_VBUSP_ECC_misc_status" offset="0xC" width="32" description="Misc Status">
		<bitfield id="NUM_RAMS" width="11" begin="10" end="0" resetval="0x20" description="Indicates the number of RAMS serviced by the ECC aggregator" range="10 - 0" rwaccess="R"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_reserved_svbus" acronym="CPSW_NUSS_VBUSP_ECC_reserved_svbus" offset="0x10" width="32" description="Reference other documents that contain the ECC RAM wrapper and EDC controller serial vbus register sets.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Serial VBUS register data" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_sec_eoi_reg" acronym="CPSW_NUSS_VBUSP_ECC_sec_eoi_reg" offset="0x3C" width="32" description="EOI Register">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_sec_status_reg0" acronym="CPSW_NUSS_VBUSP_ECC_sec_status_reg0" offset="0x40" width="32" description="Interrupt Status Register 0">
		<bitfield id="RAMECC19_PEND" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Pending Status for ramecc19_pend" range="19" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC18_PEND" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Pending Status for ramecc18_pend" range="18" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC17_PEND" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Pending Status for ramecc17_pend" range="17" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC16_PEND" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Pending Status for ramecc16_pend" range="16" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC15_PEND" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Pending Status for ramecc15_pend" range="15" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC14_PEND" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Pending Status for ramecc14_pend" range="14" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC13_PEND" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Pending Status for ramecc13_pend" range="13" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC12_PEND" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Pending Status for ramecc12_pend" range="12" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC11_PEND" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Pending Status for ramecc11_pend" range="11" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC10_PEND" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Pending Status for ramecc10_pend" range="10" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC9_PEND" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Pending Status for ramecc9_pend" range="9" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC8_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for ramecc8_pend" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC7_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for ramecc7_pend" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC6_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for ramecc6_pend" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC5_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for ramecc5_pend" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC4_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for ramecc4_pend" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for ramecc3_pend" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for ramecc2_pend" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for ramecc1_pend" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for ramecc0_pend" range="0" rwaccess="R/W1TS"/>
	</register>
