IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CPSW0_ECC.xml
	<register id="CPSW_NUSS_VBUSP_ECC_ded_eoi_reg" acronym="CPSW_NUSS_VBUSP_ECC_ded_eoi_reg" offset="0x13C" width="32" description="EOI Register">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_ded_status_reg0" acronym="CPSW_NUSS_VBUSP_ECC_ded_status_reg0" offset="0x140" width="32" description="Interrupt Status Register 0">
		<bitfield id="RAMECC19_PEND" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Pending Status for ramecc19_pend" range="19" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC18_PEND" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Pending Status for ramecc18_pend" range="18" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC17_PEND" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Pending Status for ramecc17_pend" range="17" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC16_PEND" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Pending Status for ramecc16_pend" range="16" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC15_PEND" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Pending Status for ramecc15_pend" range="15" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC14_PEND" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Pending Status for ramecc14_pend" range="14" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC13_PEND" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Pending Status for ramecc13_pend" range="13" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC12_PEND" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Pending Status for ramecc12_pend" range="12" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC11_PEND" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Pending Status for ramecc11_pend" range="11" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC10_PEND" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Pending Status for ramecc10_pend" range="10" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC9_PEND" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Pending Status for ramecc9_pend" range="9" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC8_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for ramecc8_pend" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC7_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for ramecc7_pend" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC6_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for ramecc6_pend" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC5_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for ramecc5_pend" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC4_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for ramecc4_pend" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for ramecc3_pend" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for ramecc2_pend" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for ramecc1_pend" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for ramecc0_pend" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_ded_enable_set_reg0" acronym="CPSW_NUSS_VBUSP_ECC_ded_enable_set_reg0" offset="0x180" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="RAMECC19_ENABLE_SET" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Set Register for ramecc19_pend" range="19" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC18_ENABLE_SET" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Set Register for ramecc18_pend" range="18" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC17_ENABLE_SET" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Set Register for ramecc17_pend" range="17" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC16_ENABLE_SET" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Set Register for ramecc16_pend" range="16" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC15_ENABLE_SET" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Set Register for ramecc15_pend" range="15" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC14_ENABLE_SET" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Set Register for ramecc14_pend" range="14" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC13_ENABLE_SET" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Set Register for ramecc13_pend" range="13" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC12_ENABLE_SET" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Set Register for ramecc12_pend" range="12" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC11_ENABLE_SET" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Set Register for ramecc11_pend" range="11" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC10_ENABLE_SET" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Set Register for ramecc10_pend" range="10" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC9_ENABLE_SET" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Set Register for ramecc9_pend" range="9" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC8_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for ramecc8_pend" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC7_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for ramecc7_pend" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC6_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for ramecc6_pend" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC5_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for ramecc5_pend" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC4_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for ramecc4_pend" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for ramecc3_pend" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for ramecc2_pend" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for ramecc1_pend" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="RAMECC0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for ramecc0_pend" range="0" rwaccess="R/W1TS"/>
	</register>
