IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CPSW0_ECC.xml
	<register id="CPSW_NUSS_VBUSP_ECC_ded_enable_clr_reg0" acronym="CPSW_NUSS_VBUSP_ECC_ded_enable_clr_reg0" offset="0x1C0" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="RAMECC19_ENABLE_CLR" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Clear Register for ramecc19_pend" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC18_ENABLE_CLR" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Clear Register for ramecc18_pend" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC17_ENABLE_CLR" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Clear Register for ramecc17_pend" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC16_ENABLE_CLR" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Clear Register for ramecc16_pend" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC15_ENABLE_CLR" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Clear Register for ramecc15_pend" range="15" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC14_ENABLE_CLR" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Clear Register for ramecc14_pend" range="14" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC13_ENABLE_CLR" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Clear Register for ramecc13_pend" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC12_ENABLE_CLR" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Clear Register for ramecc12_pend" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC11_ENABLE_CLR" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Clear Register for ramecc11_pend" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC10_ENABLE_CLR" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Clear Register for ramecc10_pend" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC9_ENABLE_CLR" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Clear Register for ramecc9_pend" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC8_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for ramecc8_pend" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC7_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for ramecc7_pend" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC6_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for ramecc6_pend" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC5_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for ramecc5_pend" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC4_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for ramecc4_pend" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for ramecc3_pend" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for ramecc2_pend" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for ramecc1_pend" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="RAMECC0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for ramecc0_pend" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_aggr_enable_set" acronym="CPSW_NUSS_VBUSP_ECC_aggr_enable_set" offset="0x200" width="32" description="AGGR interrupt enable set Register">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable set for svbus timeout errors" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable set for parity errors" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_aggr_enable_clr" acronym="CPSW_NUSS_VBUSP_ECC_aggr_enable_clr" offset="0x204" width="32" description="AGGR interrupt enable clear Register">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable clear for svbus timeout errors" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable clear for parity errors" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_aggr_status_set" acronym="CPSW_NUSS_VBUSP_ECC_aggr_status_set" offset="0x208" width="32" description="AGGR interrupt status set Register">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status set for svbus timeout errors" range="3 - 2" rwaccess="R/WI"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status set for parity errors" range="1 - 0" rwaccess="R/WI"/>
	</register>
	<register id="CPSW_NUSS_VBUSP_ECC_aggr_status_clr" acronym="CPSW_NUSS_VBUSP_ECC_aggr_status_clr" offset="0x20C" width="32" description="AGGR interrupt status clear Register">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status clear for svbus timeout errors" range="3 - 2" rwaccess="R/WD"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status clear for parity errors" range="1 - 0" rwaccess="R/WD"/>
	</register>
</module>